# Assignment 2 DSTT


Importing pandas and numpy to be used in this assignment

In [1]:
import pandas as pd
import numpy as np

Reading housingdata in pandas dataframe

In [2]:
df = pd.read_csv("housingdata.csv")

Displaying first 6 rows indexing from 0 to 5

In [3]:
df[:6]

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

Displaying Column names

In [4]:
list(df.columns)

['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

Displaying Rows index

In [5]:
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8]

Total no of states in dataframe

In [6]:
list(df["STATE"].shape)

[9]

In [7]:
# Alternate to shape function of pandas.
df["STATE"].count()

9

Unique states

In [8]:
list(df["STATE"].unique())

['MP', 'MAHARASHTRA', 'AP', 'TN', 'ASSAM', 'HP']

While working on NaN/Null/Empty values I got different types of values as seen below.
Therefore i will convert these values with:\
``` np.nan ```

In [9]:
df.isin(["na","--"])

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False   True
2  False  False  False         False     False  False
3  False  False  False         False     False  False
4  False  False  False         False     False  False
5  False  False  False         False     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False  False
8  False  False  False          True     False  False

In [10]:
df = df.replace(["na","--"], np.NaN)

Retriving NaN/Null/Empty values

Can be seen in this table where True=1

|    |   PID |   STATE |   PRICE |   NUM_BEDROOMS |   NUM_BATH |   SQ_FT | 
|---:|------:|--------:|--------:|---------------:|-----------:|--------:|  
|  0 |     0 |       0 |       0 |              0 |          0 |       0 | 
|  1 |     0 |       0 |       0 |              0 |          0 |       1 |
|  2 |     0 |       0 |       0 |              1 |          0 |       0 |
|  3 |     0 |       0 |       0 |              0 |          1 |       0 |
|  4 |     1 |       0 |       0 |              0 |          0 |       0 |
|  5 |     0 |       0 |       0 |              1 |          0 |       0 |
|  6 |     0 |       0 |       0 |              0 |          0 |       0 |
|  7 |     0 |       0 |       0 |              0 |          0 |       1 |
|  8 |     0 |       0 |       0 |              1 |          0 |       0 |

Retriving NaN/Null/Empty values in list format

In [11]:
df.isna().values.tolist()

[[False, False, False, False, False, False],
 [False, False, False, False, False, True],
 [False, False, False, True, False, False],
 [False, False, False, False, True, False],
 [True, False, False, False, False, False],
 [False, False, False, True, False, False],
 [False, False, False, False, False, False],
 [False, False, False, False, False, True],
 [False, False, False, True, False, False]]

Droping all rows with N/A,NA,na values in Num_Bedrooms

In [12]:
df.dropna(subset=['NUM_BEDROOMS'], inplace=True)

Converting string with
``` np.nan ``` so we could use ```df.fillna(method='ffill')``` to fill with previous value.

In [13]:
for i in df["NUM_BATH"]:
    
    try:
        type(float(i))
    except:
        df["NUM_BATH"] = df["NUM_BATH"].replace(i,np.NaN)

In [14]:
df["NUM_BATH"]=df["NUM_BATH"].fillna(method='ffill')

In [15]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5   NaN
3  100004000.0           TN     321321            1      1.5   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2        2   950
7  100008000.0           HP      23131            1        1   NaN

Replacing the empty values in “SQ_FT” with the mean of the all entries.

In [16]:
df['SQ_FT']=df['SQ_FT'].astype(float)
mean_sqft=df['SQ_FT'].mean()
df['SQ_FT'].fillna(mean_sqft,inplace=True)

In [17]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1062.5
3  100004000.0           TN     321321            1      1.5   700.0
4          NaN           TN  589465645            3        2  1600.0
6  100007000.0        ASSAM    3222321            2        2   950.0
7  100008000.0           HP      23131            1        1  1062.5

sum of SQ_FT of all houses

In [18]:
df['SQ_FT'].sum()

6375.0

Adding a new column “NUM_STORE” and with all the values as 1 for all rows

In [19]:
df['NUM_STORE'] = 1

In [20]:
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
6,100007000.0,ASSAM,3222321,2,2,950.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

Creating a DataFrame containing all entries of TN state only

In [21]:
df_tn=df[df['STATE']=='TN']

In [22]:
df_tn

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1      1.5   700.0          1
4          NaN    TN  589465645            3        2  1600.0          1

Creating a DataFrame having SQ_FT area greater than 1000

In [23]:
df_sqft_refined = df[df['SQ_FT']>1000.0]

In [24]:
df_sqft_refined

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2,1600.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

Creating a DataFrame having only first Three columns and First Three rows

In [25]:
df.iloc[0:3,0:3]

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
3  100004000.0           TN  321321

Displaying the state having highest average price per square foot of housing area.

In [26]:
state_prices=df.groupby('STATE')['PRICE','SQ_FT'].mean()
state_prices['pricepersqft']=state_prices['PRICE']/state_prices['SQ_FT']
state_prices=state_prices.sort_values('pricepersqft',ascending=True)
print(state_prices.index[0])

MAHARASHTRA

C:\Users\99sma\AppData\Local\Temp\ipykernel_3760\3378400890.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  state_prices=df.groupby('STATE')['PRICE','SQ_FT'].mean()